wegam/STM32F1xWorkSpace/Driver/WOW/SCR/STM32_USART - 20180821.C
}





































































///*******************************************************************************
//*函数名		: function
//*功能描述	:	串口DMA发送程序
//*输入			: 
//*输出			:	无
//*返回值		:	无
//*例程			:	USART_DMASend(USART2,"中文ENG=%d\n",num);
//*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
//					:	USART_BUFFER定义在STM32_USART.H
//*******************************************************************************/
//int USART_DMASend(USART_TypeDef* USARTx,u32 *tx_buffer,u16 BufferSize)		//
//{
//                                  		
//	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
//	//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
//	if(USARTx==USART1)
//	{
//		DMA1_Channel4->CNDTR =BufferSize;										//设定待发送缓冲区大小
//		DMA1_Channel4->CMAR =(u32)tx_buffer;							//发送缓冲区	
//		DMA_Cmd(DMA1_Channel4,ENABLE);											//DMA发送开启3
//	}
//	else if(USARTx==USART2)
//	{
//		DMA1_Channel7->CNDTR =BufferSize;										//设定待发送缓冲区大小
//		DMA1_Channel7->CMAR =(u32)tx_buffer;							//发送缓冲区	
//		DMA_Cmd(DMA1_Channel7,ENABLE);											//DMA发送开启3
//	}
//	else if(USARTx==USART3)
//	{
//		DMA1_Channel2->CNDTR =BufferSize;										//设定待发送缓冲区大小
//		DMA1_Channel2->CMAR =(u32)tx_buffer;							//发送缓冲区	
//		DMA_Cmd(DMA1_Channel2,ENABLE);											//DMA发送开启3
//	}
//	else if(USARTx==UART4)
//	{
//		DMA2_Channel5->CNDTR =BufferSize;										//设定待发送缓冲区大小
//		DMA2_Channel5->CMAR =(u32)tx_buffer;							//发送缓冲区	
//		DMA_Cmd(DMA2_Channel5,ENABLE);											//DMA发送开启3
//	}
//	else if(USARTx==UART5)
//	{
//		//UART5不支持DMA
//	}	
//	return BufferSize;

//}
///*******************************************************************************
//*函数名		:	USART_RX_FlagClearADDR
//*功能描述	:	清除串口DMA接收相应标志并重新设置DMA接收缓冲给地址及DMA缓存大小
//						->USART_IT_IDLE:当检测到总线空闲时，该位被硬件置位。如果USART_CR1中的IDLEIE为’1’，则产生中断。由软件序列清除该位(先读USART_SR，然后读USART_DR)。
//*输入			: 
//*输出			:	无
//*返回值		:	无
//*例程			:
//*******************************************************************************/
//u32 USART_RX_FlagClearADDR(USART_TypeDef* USARTx,u32 *rx_buffer,u16 BufferSize)				//清除串口接收中断标志--带地址
//{
//	u32 num=0;

//	if(USARTx==USART1)
//	{
//		if(USART_GetITStatus(USART1,USART_IT_IDLE)||USART_GetFlagStatus(USART1,USART_FLAG_IDLE))
//		{
//			USART_ClearITPendingBit(USART1,USART_IT_IDLE); 										//清除空闲串口标志位
//			USART_ClearFlag(USART1,USART_FLAG_IDLE); 													//清除空闲串口标志位
//			DMA_Cmd(DMA1_Channel5,DISABLE);    																//关闭接收DMA
//			num = USART1->DR; 																								//读出数据以完成清除标志			
//			num = BufferSize -  DMA_GetCurrDataCounter(DMA1_Channel5);				//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
//			DMA1_Channel5->CMAR=(u32)rx_buffer;																//重新设置DMA接收地址
//			DMA1_Channel5->CNDTR=BufferSize;																	//重新设置接收数据个数			
//			DMA_Cmd(DMA1_Channel5,ENABLE);  																	//开启接收DMA			
//			return num;
//		}
//	}
//	else if(USARTx==USART2)
//	{
//		if(USART_GetITStatus(USART2,USART_IT_IDLE)||USART_GetFlagStatus(USART2,USART_FLAG_IDLE))
//		{
//			USART_ClearITPendingBit(USART2,USART_IT_IDLE); 										//清除空闲串口标志位
//			USART_ClearFlag(USART2,USART_FLAG_IDLE); 													//清除空闲串口标志位
//			DMA_Cmd(DMA1_Channel6,DISABLE);    																//关闭接收DMA
//			num = USART2->DR; 																								//读出数据以完成清除标志			
//			num = BufferSize -  DMA_GetCurrDataCounter(DMA1_Channel5);				//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
//			DMA1_Channel6->CMAR=(u32)rx_buffer;																//重新设置DMA接收地址
//			DMA1_Channel6->CNDTR=BufferSize;																	//重新设置接收数据个数			
//			DMA_Cmd(DMA1_Channel6,ENABLE);  																	//开启接收DMA
//			return num;
//		}
//	}
//	else if(USARTx==USART3)
//	{
//		if(USART_GetITStatus(USART3,USART_IT_IDLE)||USART_GetFlagStatus(USART3,USART_FLAG_IDLE))
//		{
//			USART_ClearITPendingBit(USART3,USART_IT_IDLE); 										//清除空闲串口标志位
//			USART_ClearFlag(USART3,USART_FLAG_IDLE); 													//清除空闲串口标志位
//			DMA_Cmd(DMA1_Channel3,DISABLE);    																//关闭接收DMA
//			num = USART3->DR; 																								//读出数据以完成清除标志			
//			num = BufferSize -  DMA_GetCurrDataCounter(DMA1_Channel5);				//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
//			DMA1_Channel3->CMAR=(u32)rx_buffer;																//重新设置DMA接收地址
//			DMA1_Channel3->CNDTR=BufferSize;																	//重新设置接收数据个数			
//			DMA_Cmd(DMA1_Channel3,ENABLE);  																	//开启接收DMA
//			return num;
//		}
//	}
//	else if(USARTx==UART4)
//	{
//		if(USART_GetITStatus(UART4,USART_IT_IDLE)||USART_GetFlagStatus(UART4,USART_FLAG_IDLE))
//		{
//			USART_ClearITPendingBit(UART4,USART_IT_IDLE); 										//清除空闲串口标志位
//			USART_ClearFlag(UART4,USART_FLAG_IDLE); 													//清除空闲串口标志位
//			DMA_Cmd(DMA2_Channel3,DISABLE);    																//关闭接收DMA
//			num = UART4->DR; 																									//读出数据以完成清除标志			
//			num = BufferSize -  DMA_GetCurrDataCounter(DMA2_Channel3);				//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
//			DMA2_Channel3->CMAR=(u32)rx_buffer;																//重新设置DMA接收地址
//			DMA2_Channel3->CNDTR=BufferSize;																	//重新设置接收数据个数			
//			DMA_Cmd(DMA2_Channel3,ENABLE);  																	//开启接收DMA
//			return num;
//		}
//	}
//	else if(USARTx==UART5)
//	{
//		//UART5不支持DMA
//		return 0;
//	}
//	return 0;
////	if(status==SUCCESS)
////	{
////		free(USART_BUFFER);						//释放动态空间
////	}	
////	return status;			//返回状态值
//}
///*******************************************************************************
//*函数名		:	USART_RX_FlagClear
//*功能描述	:	清除串口DMA接收相应标志(中断/查询）
//*输入			: 相应的串口号
//*返回值		:	DMA剩余的缓冲大小（如果返回0xFFFF;表示没有中断或者没有查询到相关标志）
//*******************************************************************************/
//u16 USART_RX_FlagClear(USART_TypeDef* USARTx)				//清除串口接收中断标志
//{
//	u16 num=0xFFFF;
//	if(USARTx==USART1)
//	{
//		if(USART_GetITStatus(USART1,USART_IT_IDLE)||USART_GetFlagStatus(USART1,USART_FLAG_IDLE))
//		{
//			USART_ClearITPendingBit(USART1,USART_IT_IDLE); 										//清除空闲串口标志位
//			USART_ClearFlag(USART1,USART_FLAG_IDLE); 														//清除空闲串口标志位
//			DMA_Cmd(DMA1_Channel5,DISABLE);    																//关闭接收DMA
//			USART1->DR; 																								//读出数据以完成清除标志			
//			num = DMA_GetCurrDataCounter(DMA1_Channel5);	//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
//			return num;
//		}
//	}
//	else if(USARTx==USART2)
//	{
//		if(USART_GetITStatus(USART2,USART_IT_IDLE)||USART_GetFlagStatus(USART2,USART_FLAG_IDLE))
//		{
//			USART_ClearITPendingBit(USART2,USART_IT_IDLE); 				//清除空闲串口标志位
//			USART_ClearFlag(USART2,USART_FLAG_IDLE); 								//清除空闲串口标志位
//			DMA_Cmd(DMA1_Channel6,DISABLE);    										//关闭接收DMA
//			USART2->DR; 																					//读出数据以完成清除标志			
//			num = DMA_GetCurrDataCounter(DMA1_Channel6);					//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
//			return num;
//		}
//	}
//	else if(USARTx==USART3)
//	{
//		if(USART_GetITStatus(USART3,USART_IT_IDLE)||USART_GetFlagStatus(USART3,USART_FLAG_IDLE))
//		{
//			USART_ClearITPendingBit(USART3,USART_IT_IDLE); 				//清除空闲串口标志位
//			USART_ClearFlag(USART3,USART_FLAG_IDLE); 								//清除空闲串口标志位
//			DMA_Cmd(DMA1_Channel3,DISABLE);    										//关闭接收DMA
//			USART3->DR; 																					//读出数据以完成清除标志			
//			num = DMA_GetCurrDataCounter(DMA1_Channel3);					//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
//			return num;
//		}
//	}
//	else if(USARTx==UART4)
//	{
//		if(USART_GetITStatus(UART4,USART_IT_IDLE)||USART_GetFlagStatus(UART4,USART_FLAG_IDLE))
//		{
//			USART_ClearITPendingBit(UART4,USART_IT_IDLE); 				//清除空闲串口标志位
//			USART_ClearFlag(UART4,USART_FLAG_IDLE); 								//清除空闲串口标志位
//			DMA_Cmd(DMA2_Channel3,DISABLE);    										//关闭接收DMA
//			num = UART4->DR; 																			//读出数据以完成清除标志			
//			num = DMA_GetCurrDataCounter(DMA2_Channel3);					//得到真正接收数据个数(DMA_GetCurrDataCounter返回当前DMA通道x剩余的待传输数据数目)
//			return num;
//		}
//	}
//	else if(USARTx==UART5)
//	{
//		//UART5不支持DMA
//		return 0xFFFF;
//	}
//	return 0xFFFF;
//}
///*******************************************************************************
//*函数名		:	USART_RX_DMAFlagClear
//*功能描述	:	设置串口接收DMA缓冲区的地址、大小及使能相应DMA
//*输入			: 相应的串口号
//*返回值		:	无
//*******************************************************************************/
//void USART_DMA_RxEN(USART_TypeDef* USARTx,u32 *rx_buffer,u16 BufferSize)				//清除串口接收中断标志
//{
//	if(USARTx==USART1)
//	{
//		DMA1_Channel5->CMAR=(u32)rx_buffer;			//重新设置DMA接收地址
//		DMA1_Channel5->CNDTR=BufferSize;				//重新设置接收数据个数			
//		DMA_Cmd(DMA1_Channel5,ENABLE);  				//开启接收DMA
//	}
//	else if(USARTx==USART2)
//	{
//		DMA1_Channel6->CMAR=(u32)rx_buffer;			//重新设置DMA接收地址
//		DMA1_Channel6->CNDTR=BufferSize;				//重新设置接收数据个数				
//		DMA_Cmd(DMA1_Channel6,ENABLE);  				//开启接收DMA
//	}
//	else if(USARTx==USART3)
//	{
//		DMA1_Channel3->CMAR=(u32)rx_buffer;			//重新设置DMA接收地址
//		DMA1_Channel3->CNDTR=BufferSize;				//重新设置接收数据个数				
//		DMA_Cmd(DMA1_Channel3,ENABLE);  				//开启接收DMA
//	}
//	else if(USARTx==UART4)
//	{
//		DMA2_Channel3->CMAR=(u32)rx_buffer;			//重新设置DMA接收地址
//		DMA2_Channel3->CNDTR=BufferSize;				//重新设置接收数据个数				
//		DMA_Cmd(DMA2_Channel3,ENABLE);  				//开启接收DMA
//	}
//	else if(USARTx==UART5)
//	{
//		//UART5不支持DMA
//	}
//}
///*******************************************************************************
//*函数名		:	USART_TX_DMAFlagClear
//*功能描述	:	清除串口DMA发送全局中断标志
//						->当传输完成DMA控制器指定的数据量时，DMA控制器在该DMA通道的中断向量上产生一中断。
//						->在发送模式下，当DMA传输完所有要发送的数据时，DMA控制器设置DMA_ISR寄存器的TCIF标志；
//						->监视USART_SR寄存器的TC标志可以确认USART通信是否结束，这样可以在关闭USART或进入停机模式之前避免破坏最后一次传输的数据；
//						->软件需要先等待TXE=1，再等待TC=1。
//*输入			: 
//*输出			:	无
//*返回值		:	无
//*例程			:
//*******************************************************************************/
//ErrorStatus USART_TX_DMAFlagClear(USART_TypeDef* USARTx)				//清除串口DMA发送全局中断标志
//{
//	ErrorStatus status = ERROR;
//	u32	DMA_status=0;
//	u16 DMA_NUM=0;
////	DMA_GetCurrDataCounter(DMA2_Channel5);						//获取DMA发送缓冲区剩余数据个数
////	DMA_status=*(vu32*)DMA2_Channel5_BASE;						//检测相关DMA通道开关与否
//	if(USARTx==USART1)
//	{
//		DMA_status=*(vu32*)DMA1_Channel4_BASE;		
//		if((DMA_status&0x00000001)==0x00000001)						//DMA通道已经使能
//		{
//			DMA_NUM=DMA_GetCurrDataCounter(DMA1_Channel4);	//获取DMA发送缓冲区剩余数据个数
//			if(!DMA_NUM)					//判断DMA数据有无发送完成
//			{
//				DMA_ClearFlag(DMA1_FLAG_TC4);								//清除标志
//				DMA_Cmd(DMA1_Channel4,DISABLE);							//DMA发送关闭
//			//			free(USART_BUFFER);										//释放动态空间
//				status = SUCCESS;
//			}
//			else			//未传输完成
//			{
//				status = ERROR;
//			}
//		}
//		else			//DMA未打开
//		{
//			status = SUCCESS;
//		}
//	}
//	else if(USARTx==USART2)
//	{
//		DMA_status=*(vu32*)DMA1_Channel7_BASE;
//		if((DMA_status&0x00000001)==0x00000001)
//		{
//			if(DMA_GetFlagStatus(DMA1_FLAG_TC7))
//			{
//				DMA_ClearFlag(DMA1_FLAG_TC7);
//				DMA_Cmd(DMA1_Channel7,DISABLE);			//DMA发送关闭
//			//			free(USART_BUFFER);									//释放动态空间
//				status = SUCCESS;
//			}
//			else
//			{
//				status = ERROR;
//			}
//		}
//		else
//		{
//			status = SUCCESS;
//		}
//	}
//	else if(USARTx==USART3)
//	{
//		DMA_status=*(vu32*)DMA1_Channel2_BASE;
//		if((DMA_status&0x00000001)==0x00000001)
//		{
//			if(DMA_GetFlagStatus(DMA1_FLAG_TC2))
//			{
//				DMA_ClearFlag(DMA1_FLAG_TC2);
//				DMA_Cmd(DMA1_Channel2,DISABLE);			//DMA发送关闭
//			//			free(USART_BUFFER);									//释放动态空间
//				status = SUCCESS;
//			}
//			else
//			{
//				status = ERROR;
//			}
//		}
//		else
//		{
//			status = SUCCESS;
//		}
//	}
//	else if(USARTx==UART4)
//	{
//		DMA_status=*(vu32*)DMA2_Channel5_BASE;
//		if(((DMA_status&0x00000001)==0x00000001))
//		{
//			DMA_NUM=DMA_GetCurrDataCounter(DMA2_Channel5);	//获取DMA发送缓冲区剩余数据个数
//			if(!DMA_NUM)
//			{
//				DMA_ClearFlag(DMA2_FLAG_TC5);
//				DMA_Cmd(DMA2_Channel5,DISABLE);			//DMA发送关闭
//			//			free(USART_BUFFER);									//释放动态空间
//				status = SUCCESS;
//			}
//			else
//			{
//				status = ERROR;
//			}
//		}
//		else
//		{
//			DMA_Cmd(DMA2_Channel5,DISABLE);			//DMA发送关闭
//			status = SUCCESS;
//		}
//	}
//	else if(USARTx==UART5)
//	{
////		if(DMA_GetFlagStatus(DMA1_FLAG_TC4))
////		{
////			DMA_ClearFlag(DMA1_FLAG_TC4);
////			DMA_Cmd(DMA1_Channel4,DISABLE);			//DMA发送关闭
////		//			free(USART_BUFFER);									//释放动态空间
////			status = SUCCESS;
////		}
////		else
////		{
//			status = ERROR;
////		}
//	}
//	if(status==SUCCESS)
//	{
//		//free(USART_BUFFER);						//释放动态空间
//	}	
//	return status;			//返回状态值

//}
///*******************************************************************************
//*函数名		:	USART_TX_DMAFlagClear
//*功能描述	:	清除串口DMA发送全局中断标志
//						->当传输完成DMA控制器指定的数据量时，DMA控制器在该DMA通道的中断向量上产生一中断。
//						->在发送模式下，当DMA传输完所有要发送的数据时，DMA控制器设置DMA_ISR寄存器的TCIF标志；
//						->监视USART_SR寄存器的TC标志可以确认USART通信是否结束，这样可以在关闭USART或进入停机模式之前避免破坏最后一次传输的数据；
//						->软件需要先等待TXE=1，再等待TC=1。
//*输入			: 
//*输出			:	无
//*返回值		:	无
//*例程			:
//*******************************************************************************/
//u8 USART_TX_FlagClear(USART_TypeDef* USARTx)				//清除串口DMA发送全局中断标志
//{
////	ErrorStatus status = ERROR;
////	u32	DMA_status=0;
////	u16 DMA_NUM=0;
////	DMA_GetCurrDataCounter(DMA2_Channel5);						//获取DMA发送缓冲区剩余数据个数
////	DMA_status=*(vu32*)DMA2_Channel5_BASE;						//检测相关DMA通道开关与否
//	if(USARTx==USART1)
//	{
//		if(DMA_GetFlagStatus(DMA1_FLAG_GL4))
//		{
//			if(USART_GetFlagStatus(USART1,USART_FLAG_TC))
//			{
//				USART_ClearFlag(USART1,USART_FLAG_TC); 										//清除空闲串口标志位
//				DMA_ClearFlag(DMA1_FLAG_GL4);
//				DMA_Cmd(DMA1_Channel4,DISABLE);  													//关闭DMA发送
//				return 1;
//			}
//		}
//	}
//	else if(USARTx==USART2)
//	{
//		if(DMA_GetFlagStatus(DMA1_FLAG_GL7))
//		{
//			if(USART_GetFlagStatus(USART2,USART_FLAG_TC))
//			{
//				USART_ClearFlag(USART2,USART_FLAG_TC); 										//清除空闲串口标志位
//				DMA_ClearFlag(DMA1_FLAG_GL7);
//				DMA_Cmd(DMA1_Channel7,DISABLE);  													//关闭DMA发送
//				return 1;
////				memset(txBuffer_PD, 0x00, BufferSize);
//			}
//		}
//	}
//	else if(USARTx==USART3)
//	{
//		if(DMA_GetFlagStatus(DMA1_FLAG_GL2))
//		{
//			if(USART_GetFlagStatus(USART3,USART_FLAG_TC))
//			{
//				USART_ClearFlag(USART3,USART_FLAG_TC); 										//清除空闲串口标志位
//				DMA_ClearFlag(DMA1_FLAG_GL2);
//				DMA_Cmd(DMA1_Channel2,DISABLE);  													//关闭DMA发送
//				return 1;
////				memset(txBuffer_Bus, 0x00, BufferSize);
//			}
//		}
//	}
//	else if(USARTx==UART4)
//	{
//		if(DMA_GetFlagStatus(DMA2_FLAG_GL5))
//		{
//			if(USART_GetFlagStatus(UART4,USART_FLAG_TC))
//			{
//				USART_ClearFlag(UART4,USART_FLAG_TC); 										//清除空闲串口标志位
//				DMA_ClearFlag(DMA2_FLAG_GL5);
//				DMA_Cmd(DMA2_Channel5,DISABLE);  													//关闭DMA发送
//				return 1;
////				memset(txBuffer_Bus, 0x00, BufferSize);
//			}
//		}
//	}
//	else if(USARTx==UART5)
//	{
//		return 0;
////	UART5不支持DMA
//	}
//	return 0;			//返回状态值

//}
/*******************************************************************************
* 函数名		:	
* 功能描述	:	printf重定义 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
int fputc(int ch, FILE *f)				//printf重定义
{

	USART_SendData(USART2, (unsigned char) ch);// USART1 可以换成 USART2 等

	while(!(USART_GetFlagStatus(USART2, USART_FLAG_TXE) == SET));

	return (ch);

